Revit 2027 API
ParameterTypeId.AssemblyName Property
 "Assembly Name"
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static ForgeTypeId AssemblyName { get; }
Public Shared ReadOnly Property AssemblyName As ForgeTypeId
	Get
public:
static property ForgeTypeId^ AssemblyName {
	ForgeTypeId^ get ();
}
static member AssemblyName : ForgeTypeId with get
Property Value
ForgeTypeId
See Also
Reference
ParameterTypeId Class
Autodesk.Revit.DB Namespace